Repository: Lfrangt/pulse-watch
Catalog: PulseWatch/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Peak recovery — go all out today
zh_hans: 恢复极佳，今天可以全力冲

source: Permissions Needed
zh_hans: 需要一些权限

source: Personalized training advice based on your recovery. Push day or rest day? AI analyzes your data and tells you exactly what to do.
zh_hans: 基于恢复状态的个性化训练建议。今天该练还是该休息？AI 分析你的数据，告诉你答案。

source: Plan
zh_hans: 计划

source: Plank
zh_hans: 平板支撑

source: Poor
zh_hans: 较差

source: Poor sleep — energy may be low, try to catch up
zh_hans: 睡眠质量较差，今天可能精力不足，注意补觉

source: Poor sleep — prioritize rest tonight
zh_hans: 睡眠较差，今晚优先休息

source: Power Saving
zh_hans: 省电模式

source: Privacy
zh_hans: 隐私说明

source: Privacy Policy
zh_hans: 隐私政策

source: Profile
zh_hans: 个人信息

source: Progressive Overload
zh_hans: 渐进超载

source: Provisional
zh_hans: 临时授权

source: Pull
zh_hans: 拉 Pull

source: Pull (Back)
zh_hans: 拉（背部）

source: Pull-up
zh_hans: 引体向上

source: Pulse Watch is collecting health data\nYour first score will appear in a few hours
zh_hans: Pulse Watch 正在后台收集你的健康数据\n几小时后就能看到你的第一份状态评分

source: Pulse Weekly
zh_hans: Pulse 周报

source: Push
zh_hans: 推 Push

source: Push (Chest/Shoulders)
zh_hans: 推（胸/肩）

source: Push health data to your AI Agent for personalized training advice
zh_hans: 健康数据通过 API 推送给你的 AI Agent，获取个性化训练建议和健康分析

source: Read heart rate, HRV, sleep data
zh_hans: 读取心率、HRV、睡眠等健康数据

source: Readiness
zh_hans: 准备度

source: Readiness %d — %@ intensity recommended
zh_hans: 准备度 %d — 建议%@强度

source: Ready for high intensity today 💪
zh_hans: 今天适合高强度训练 💪

source: Ready to start training?
zh_hans: 准备开始训练？

source: Ready to train
zh_hans: 适合训练

source: Recent Records
zh_hans: 最近记录

source: Recent Workouts
zh_hans: 最近训练

source: Recommended
zh_hans: 推荐

source: Reconfigure
zh_hans: 重新配置

source: Record your first lift
zh_hans: 记录你的第一次训练

source: Record your lifts and track your progress
zh_hans: 记录你的成绩，追踪你的进步

source: Record your lifts in Strength tracking
zh_hans: 去力量追踪里记录你的成绩

source: Recorded by OpenClaw AI
zh_hans: 由 OpenClaw AI 记录

source: Recovery
zh_hans: 放松恢复

source: Recovery %@
zh_hans: 恢复 %@

source: Recovery +15
zh_hans: 恢复 +15

source: Recovery +\(min(20, insight.sleepScore / 5))
zh_hans: 恢复 +\(min(20, insight.sleepScore / 5))

source: Recovery 82 — great day for strength training! 💪
zh_hans: 恢复 82 分 — 今天适合力量训练！💪

source: Recovery Insights
zh_hans: 恢复关联洞察

source: Recovery Score
zh_hans: 恢复评分

source: Recovery \(score)
zh_hans: 恢复 \(score)

source: Reduce intensity, prioritize sleep quality
zh_hans: 建议减少高强度训练，优先保证睡眠质量

source: Remind you when arriving at gym
zh_hans: 到达健身房时提醒你

source: Remove
zh_hans: 移除

source: Reps
zh_hans: 次数

source: Reset Onboarding
zh_hans: 重置引导

source: Rest
zh_hans: 需要休息

source: Rest Day
zh_hans: 休息日

source: Rest day — skip training today
zh_hans: 身体需要休息，建议今天不训练

source: Rest day — your body needs full recovery
zh_hans: 今天需要充分休息，不要强撑训练

source: Rest recommended
zh_hans: 建议休息

source: Rest suggested
zh_hans: 建议休息

source: Resting
zh_hans: 静息

source: Resting Calories
zh_hans: 静息卡路里

source: Resting HR
zh_hans: 静息心率

source: Resting HR --
zh_hans: 静息心率 --

source: Resting HR 58bpm
zh_hans: 静息心率 58bpm

source: Resting HR 62bpm
zh_hans: 静息心率 62bpm

source: Resting HR \(Int(rhr))bpm
zh_hans: 静息心率 \(Int(rhr))bpm

source: Resting HR dropped %.0f bpm — good sign
zh_hans: 静息心率下降了 %.0f bpm，好迹象

source: Resting HR elevated
zh_hans: 静息心率偏高

source: Resting HR elevated (\(Int(rhr))bpm)
zh_hans: 静息心率偏高(\(Int(rhr))bpm)

source: Resting HR elevated — possible fatigue or stress
zh_hans: 静息心率近期偏高，可能是疲劳或压力信号

source: Resting HR elevated: \(Int(current))bpm vs baseline \(Int(baseline))bpm
zh_hans: 静息心率偏高：当前 \(Int(current))bpm，基线 \(Int(baseline))bpm

source: Resting HR is elevated — cardio training can help lower it
zh_hans: 静息心率偏高，有氧训练可有效降低

source: Resting HR is elevated — more aerobic exercise can help
zh_hans: 静息心率偏高，建议增加有氧运动

source: Resting HR is in a healthy range
zh_hans: 静息心率在健康范围内

source: Resting HR significantly elevated
zh_hans: 静息心率显著偏高

source: Resting HR up %.0f bpm — watch recovery
zh_hans: 静息心率上升 %.0f bpm，注意恢复

source: Resting HR vs Baseline
zh_hans: 静息心率 vs 基线

source: Resting HR: %@
zh_hans: 静息心率：%@

source: Resting HR: %@%@
zh_hans: 静息心率：%@%@

source: Resting Heart Rate
zh_hans: 静息心率

source: Resting heart rate has been stable
zh_hans: 静息心率保持稳定

source: Romanian Deadlift
zh_hans: 罗马尼亚硬拉

source: Row
zh_hans: 划船

source: Rowing
zh_hans: 划船

source: Run openclaw pair --qr in terminal
zh_hans: 终端运行 openclaw pair --qr 获取二维码

source: Running
zh_hans: 跑步

source: Same alert won't repeat within 1 hour
zh_hans: 同一异常 1 小时内不重复提醒

source: Sat
zh_hans: 六

source: Save Plan & Close
zh_hans: 保存计划并关闭

source: Save Record
zh_hans: 保存记录

source: Save Workout
zh_hans: 保存训练

source: Saved
zh_hans: 已保存

source: Scan OpenClaw pairing QR code
zh_hans: 扫描 OpenClaw 配对二维码

source: Scan to Connect
zh_hans: 扫码连接

source: Score
zh_hans: 评分

source: Search Gym
zh_hans: 搜索健身房

source: Search for your gym
zh_hans: 搜索你常去的健身房

source: Seated Row
zh_hans: 坐姿划船

source: Sedentary
zh_hans: 活动不足

source: Sedentary (<4000 steps) — cardiovascular and metabolic risk significantly elevated (JAMA 2022)
zh_hans: 长期久坐（<4000步），心血管和代谢风险显著上升（JAMA 2022）

source: See your progress over time
zh_hans: 看见自己的进步轨迹

source: Send Feedback
zh_hans: 发送反馈

source: Set Frequent Location
zh_hans: 设置常去地点

source: Set Gym Location
zh_hans: 设置健身房位置

source: Set Up Later
zh_hans: 稍后设置

source: Set a new PR 4 weeks in a row
zh_hans: 连续 4 周有新 PR

source: Set body weight in Settings → Profile
zh_hans: 请在设置 → 个人信息中填写体重

source: Set your body weight in Settings → Profile
zh_hans: 请先在设置 → 个人信息中填写体重

source: Sets
zh_hans: 组数

source: Settings
zh_hans: 设置

source: Severe sleep deficit
zh_hans: 睡眠严重不足

source: Severe sleep deficit — significantly higher mortality risk (CDC 2016)
zh_hans: 严重睡眠不足，死亡率风险显著升高（CDC 2016）

source: Share
zh_hans: 分享

source: Share Progress
zh_hans: 分享进步

source: Share Report
zh_hans: 分享周报

source: Share Workout
zh_hans: 分享训练

source: Short on sleep — train but don't overdo it
zh_hans: 睡眠偏少，训练可以但别过猛

source: Shoulder Press
zh_hans: 肩推

source: Shoulders
zh_hans: 肩部

source: Show UI with simulated data
zh_hans: 使用模拟数据展示完整界面效果

source: Show welcome guide again on next launch
zh_hans: 下次启动时显示欢迎引导

source: Skip
zh_hans: 跳过

source: Skip Today
zh_hans: 跳过今天

source: Sleep
zh_hans: 睡眠

source: Sleep %d · Activity %d · Readiness %d
zh_hans: 睡眠 %d · 活动 %d · 准备度 %d

source: Sleep %dh
zh_hans: 睡眠 %dh

source: Sleep %dh%dm
zh_hans: 睡眠 %dh%dm

source: Sleep Duration
zh_hans: 睡眠时长

source: Sleep Quality
zh_hans: 睡眠质量

source: Sleep Score
zh_hans: 睡眠评分

source: Sleep \(sleepDisplay) · Recovery \(insight.recoveryScore)
zh_hans: 睡眠 \(sleepDisplay) · 恢复 \(insight.recoveryScore)分

source: Sleep could be better — try earlier bedtime
zh_hans: 睡眠不佳，试试早点上床

source: Sleep deficit — train lightly, rest early tonight
zh_hans: 睡眠不足，适度训练，今晚早点休息

source: Sleep deficit — try to catch up today
zh_hans: 睡眠不足，今天注意补觉

source: Sleep duration in optimal range (Walker 2017)
zh_hans: 睡眠时长在最优区间（Walker 2017 推荐）

source: Sleep duration is in the optimal range
zh_hans: 睡眠时长在最佳范围内

source: Sleep is too short — aim for 7-9 hours
zh_hans: 睡眠不足，建议保证 7-9 小时

source: Sleep —
zh_hans: 睡眠 —

source: Sleeping a bit long — check sleep efficiency and quality
zh_hans: 睡眠偏多，注意睡眠效率和质量

source: Slight decline this week — adjust rest and training
zh_hans: 本周状态有所下滑，注意调整作息和训练强度

source: Slightly short on sleep — aim for 7-8 hours
zh_hans: 睡眠略不足，建议延长至 7-8 小时

source: Smart reminders when you arrive at the gym
zh_hans: 到达健身房时智能提醒训练计划

# Smart trend & anomaly detection All processing done on-device
source: Smart trend & anomaly detection\nAll processing done on-device
zh_hans: 智能分析趋势和异常\n所有计算在设备本地完成

source: Soccer
zh_hans: 足球

source: SpO2 Reference Ranges
zh_hans: 血氧参考区间

source: SpO2 reflects how well your blood carries oxygen. It is measured by the infrared sensor on the back of your Apple Watch.
zh_hans: SpO₂ 反映血液中氧气的运输效率，由 Apple Watch 背部红外传感器测量。

source: Squat
zh_hans: 深蹲

source: Squat your body weight
zh_hans: 深蹲突破自身体重

source: Stable
zh_hans: 保持平稳

source: Stable — your body is adapting well
zh_hans: 状态保持稳定，身体适应良好

source: Stair Climbing
zh_hans: 爬楼梯

source: Standard
zh_hans: 标准

source: Start Timer
zh_hans: 开始计时

source: Start Training
zh_hans: 开始训练

source: Start Workout
zh_hans: 开始训练

source: Status
zh_hans: 通知状态

source: Step count is low — aim for at least 8000 steps per day
zh_hans: 步数偏低，建议每天步行至少 8000 步

source: Step count is solid — keep it up
zh_hans: 步数达标，继续保持

source: Step count on target (8000+) — low sedentary risk
zh_hans: 步数达标（≥8000步），久坐风险低

source: Steps
zh_hans: 步数

source: Steps are below average — try walking 30 min daily
zh_hans: 步数偏低，建议每天步行 30 分钟

source: Still recovering — avoid high intensity
zh_hans: 身体在恢复中，避免高强度

source: Still recovering — go easy today
zh_hans: 仍在恢复，今天轻松点

source: Still recovering — light activity like walking or yoga
zh_hans: 身体仍在恢复，建议轻松活动如散步或瑜伽

source: Still recovering — light activity only
zh_hans: 身体还在恢复，轻松活动即可

source: Strain %d, Recovery %d
zh_hans: 负荷 %d，恢复 %d

source: Strain Score
zh_hans: 运动负荷

source: Strength
zh_hans: 力量训练

source: Strength Score
zh_hans: 力量评分

source: Strength Training
zh_hans: 力量训练

source: Strength training raises resting metabolic rate — muscle burns more calories even at rest.
zh_hans: 力量训练后静息代谢率会升高——肌肉在休息时也会消耗更多热量。

source: Suggested: %@ — Watch notified
zh_hans: 建议：%@ — 已通知手表

source: Suggested: \(localizedGroup(plan.targetMuscleGroup))
zh_hans: 建议练\(localizedGroup(plan.targetMuscleGroup))

source: Suggested: \(localizedGroup(plan.targetMuscleGroup)) — Watch notified
zh_hans: 建议今天练\(localizedGroup(plan.targetMuscleGroup))，已通知手表

source: Summary
zh_hans: 摘要

source: Sun
zh_hans: 日

source: Sunday 8 PM — record your new PRs
zh_hans: 每周日 20:00 提醒记录新 PR

source: Swimming
zh_hans: 游泳

source: Syncing
zh_hans: 同步中

source: Table Tennis
zh_hans: 乒乓球

source: Take it easy
zh_hans: 注意休息

source: Tennis
zh_hans: 网球

source: The welcome guide will appear next time you open the app.
zh_hans: 欢迎引导将在下次打开 App 时显示。

source: This Week
zh_hans: 本周

source: This Week's Exercise
zh_hans: 本周运动

source: This action cannot be undone. The original HealthKit data will not be affected.
zh_hans: 此操作无法撤消。原始 HealthKit 数据不受影响。

source: This will delete all saved workout history from the app. Health data in Apple Health will not be affected.
zh_hans: 这将删除 App 中保存的所有训练记录。Apple 健康中的数据不受影响。

source: Thu
zh_hans: 四

source: Time Range
zh_hans: 时间范围

source: Today
zh_hans: 今日

source: Today's Insights
zh_hans: 今日洞察

source: Today's Pick
zh_hans: 今日推荐

source: Today's Score · Tap for details
zh_hans: 今日状态评分 · 点击查看摘要

source: Today's Training
zh_hans: 今日训练

source: Token
zh_hans: 令牌

source: Top Muscle
zh_hans: 最常练部位

source: Total
zh_hans: 总计

source: Total 300kg across all three lifts
zh_hans: 三大项总和突破 300kg

source: Total 7h12m · Deep ~1.8h
zh_hans: 总计 7h12m · 深睡约 1.8h

source: Total 7h35m · Deep ~2.1h
zh_hans: 总计 7h35m · 深睡约 2.1h

source: Total Burned
zh_hans: 总消耗

source: Total Duration
zh_hans: 总训练时长

source: Total Sleep
zh_hans: 总睡眠

source: Total Training Time
zh_hans: 总训练时长

source: Total \(sleepHours)h\(sleepMins)m · Deep ~\(String(format:
zh_hans: 总计 \(sleepHours)h\(sleepMins)m · 深睡约 \(String(format:

source: Tracked with Pulse Watch
zh_hans: Pulse Watch 记录

source: Train
zh_hans: 训练

source: Training Advice
zh_hans: 训练建议

source: Training Calendar
zh_hans: 训练日历

source: Training Days
zh_hans: 训练天数

source: Training Plan
zh_hans: 训练计划

source: Training Records
zh_hans: 训练记录

source: Training Reminders
zh_hans: 训练提醒

source: Training Rotation
zh_hans: 训练轮换

source: Training in progress
zh_hans: 训练进行中

# Training intensity based on recovery Auto-remind at the gym
source: Training intensity based on recovery\nAuto-remind at the gym
zh_hans: 根据恢复状态推荐训练强度\n到达健身房自动提醒

source: Treadmill Run
zh_hans: 跑步机

source: Trend
zh_hans: 趋势

source: Trends
zh_hans: 趋势

source: Tricep Pushdown
zh_hans: 三头下压

source: Try +2.5kg this week
zh_hans: 本周可尝试 +2.5kg

source: Tue
zh_hans: 二

source: Type
zh_hans: 类型

source: Units
zh_hans: 单位

source: Unknown
zh_hans: 未知

source: Use Current Location
zh_hans: 使用当前位置

source: Used to calculate your Health Age
zh_hans: 用于计算你的生理年龄

source: Verify & Connect
zh_hans: 验证并连接

source: Verifying...
zh_hans: 验证中...

source: Version
zh_hans: 版本

source: Very low activity — any movement helps
zh_hans: 活动量很低，任何运动都有帮助

source: Very low resting HR — typical of endurance athletes
zh_hans: 静息心率极低，通常见于耐力运动员

source: View Details
zh_hans: 查看详情

source: View Full Report
zh_hans: 查看完整周报

source: View Full Strength Details
zh_hans: 查看完整力量详情

source: View Trends
zh_hans: 查看趋势

source: Waiting to sync
zh_hans: 等待同步

source: Walking
zh_hans: 步行

source: Walking is the simplest aerobic exercise — it helps improve heart health, mood, and metabolic function.
zh_hans: 步行是最简单的有氧运动——有助于改善心脏健康、情绪和代谢功能。

source: Warm-up
zh_hans: 热身

source: Warning
zh_hans: 注意

source: Watch Sync
zh_hans: 手表联动

# Watch face complication Glance at your status anytime
source: Watch face complication\nGlance at your status anytime
zh_hans: 表盘 Complication 实时显示\n手腕上即时查看状态

source: Watch notified
zh_hans: 已通知手表

source: Weak Recovery
zh_hans: 恢复偏弱

source: Weak recovery
zh_hans: 恢复较弱

source: Wear your watch for %d more days to unlock
zh_hans: 再佩戴手表 %d 天即可解锁

source: Wed
zh_hans: 三

source: Weekly Comparison
zh_hans: 周报对比

source: Weekly Health Summary
zh_hans: 每周健康总结

source: Weekly PB Reminder
zh_hans: 每周 PB 提醒

source: Weekly Report
zh_hans: 周报

source: Weekly Score: %d%@
zh_hans: 本周评分：%d%@

source: Weekly Trends
zh_hans: 一周趋势

source: Weight
zh_hans: 体重

source: Weight (kg)
zh_hans: 重量 (kg)

source: What Affects Health Age?
zh_hans: 什么影响生理年龄？

source: What are you training today?
zh_hans: 今天练哪里？

source: Why Steps Matter
zh_hans: 为什么步数重要？

source: Workout Complete
zh_hans: 训练完成

source: Workout Complete! 🎉
zh_hans: 训练完成！🎉

source: Workout Completed
zh_hans: 完成训练

source: Workout History
zh_hans: 训练记录

source: Workout Type
zh_hans: 运动类型

source: Workouts: %d sessions%@
zh_hans: 训练：%d 次%@

source: Worst day: \(worstLabel) \(worstDay.dailyScore ?? 0)pts\(worstReason)
zh_hans: 本周最低日：\(worstLabel) \(worstDay.dailyScore ?? 0)分\(worstReason)

source: Yesterday
zh_hans: 昨天

source: Yoga
zh_hans: 瑜伽

source: You are Pulse Coach, a personal fitness AI. Analyze HealthKit data and provide health insights and training advice. Reply in JSON.
zh_hans: 你是 Pulse Coach，用户的私人健身教练 AI。根据 HealthKit 数据给出精准的健康分析和训练建议。回复 JSON 格式。

source: You're at the Gym 💪
zh_hans: 你到健身房了 💪

source: You've tracked your health for %d days straight. Keep it up!
zh_hans: 你已经连续记录健康数据 %d 天了，继续加油！

source: Your Smart Health Companion
zh_hans: 你的智能健康伙伴

source: Your Training Plan
zh_hans: 你的训练计划

source: Your body needs rest today
zh_hans: 身体需要充分休息，今天建议完全休息

source: Your body needs rest — don't push it
zh_hans: 身体需要休息，今天别硬撑

source: Your body says stop — rest up 😴
zh_hans: 身体在喊停，今天好好休息吧 😴

# Your data stays on your device We never upload anything
source: Your data stays on your device\nWe never upload anything
zh_hans: 你的数据仅存储在设备上\n我们不会上传任何信息

source: Your longest consecutive health tracking streak
zh_hans: 你历史上最长的连续健康记录

source: Your personal fitness advisor
zh_hans: 你的私人健身顾问

source: Your resting heart rate is %lld bpm, above your %lld bpm threshold. Consider resting and monitoring.
zh_hans: 您的静息心率为 %lld bpm，超过 %lld bpm 阈值。建议休息并持续关注。

source: Your resting heart rate is %lld bpm, below your %lld bpm threshold. If you feel dizzy, seek medical attention.
zh_hans: 您的静息心率为 %lld bpm，低于 %lld bpm 阈值。如感到头晕，请就医。

source: Your score has been steady this period
zh_hans: 这段时间评分保持稳定

source: Your score is down %d points vs last period
zh_hans: 评分比上个时段下降了 %d 分

source: Your score is up %d points vs last period
zh_hans: 评分比上个时段上升了 %d 分

source: Your weekly health performance, trends, and advice
zh_hans: 查看你这一周的健康表现、趋势分析和下周建议

source: Your workout records will appear here. Supports running, cycling, swimming, strength training, and more.
zh_hans: 你的训练记录将显示在这里。 支持跑步、骑行、游泳、力量训练等。

source: Your workout records will appear here.\nSupports running, cycling, swimming, strength training, and more.
zh_hans: 开始一次运动后，你的记录会显示在这里。\n支持跑步、骑行、游泳、力量训练等。

source: \(nights) consecutive nights under 6 hours
zh_hans: 连续 \(nights) 晚睡眠不足 6 小时

source: by muscle group
zh_hans: 按肌群分析

source: days
zh_hans: 天

source: decreases
zh_hans: 下降

source: h
zh_hans: 时

source: hour
zh_hans: 小时

source: improves
zh_hans: 提升

source: increases
zh_hans: 上升

source: kcal
zh_hans: 千卡

source: min
zh_hans: 分钟

source: older
zh_hans: 偏老

source: pts
zh_hans: 分

source: steps
zh_hans: 步

source: vs prev 30d
zh_hans: vs 30天前

source: vs prev 90d
zh_hans: vs 90天前

source: younger
zh_hans: 更年轻

source: ~%d min
zh_hans: 约 %d 分钟

source: ☀️ Good Morning, Pulse
zh_hans: ☀️ 早安 Pulse

source: ☀️ Morning · Score \(insight.dailyScore)
zh_hans: ☀️ 早安 · 状态 \(insight.dailyScore)分

source: ☀️ Put on your watch to start tracking
zh_hans: \u{2600}\u{FE0F} 戴上手表，开始记录你的一天

source: ⚠️ High Heart Rate Alert
zh_hans: ⚠️ 心率过高警告

source: ⚠️ Low Heart Rate Alert
zh_hans: ⚠️ 心率过低警告

source: ⚠️ Rest today
zh_hans: ⚠️ 今天休息

source: ⚡ Light exercise
zh_hans: ⚡ 轻度运动

source: ✅ Ready to train
zh_hans: ✅ 可以训练

source: 📊 Weekly health report ready
zh_hans: 📊 本周健康周报已生成

source: 🔥 %d-Day Streak!
zh_hans: 🔥 连续 %d 天！
